// console.log(console);

// function myFunc(a){
//     console.log(a**2);
    
// }
// myFunc (5)

// // Объявить функцию, которая считывает значение через prompt и выводит “ДА” если число четное и “НЕТ” в ином случае.

// function even(a){
//     console.log('function even: ');
    
//     // if (a%2 ===0) return true;
//     // if (a%2 !==0) return false;

//     // return a%2===0

//     if(a%2===0){
//         return'Yes'
//         // console.log('Yes');
//     }
//     else {
//         return 'No'
//         // console.log('No');
        
//     }
// }
// let a=+prompt('function even: ')
// console.log(even(a));



// // Передача данных в функцию:
// // Когда ты вызываешь функцию и передаёшь ей аргумент, этот аргумент попадает в параметры функции.

// function greet(name) {  // 'name' - это параметр функции
//     console.log("Hello, " + name + "!");
// }

// greet("John");  // "John" - это аргумент, передаваемый в функцию

// // ***********************************************************************************************
// // ***********************************************************************************************


// // Возврат данных из функции:
// // Чтобы вернуть значение из функции, используется оператор return.

// function add(a, b) {  // 'a' и 'b' - это параметры функции
//     return a + b;  // возвращаем сумму 'a' и 'b'
// }

// let sum = add(2, 3);  // результат вызова функции 'add' присваивается переменной 'sum'
// console.log(sum);  // выводим значение переменной 'sum'


// // ***********************************************************************************************
// // ***********************************************************************************************


// // Задания для практики
// // Задание 1:
// // Напиши функцию, которая принимает число и возвращает его квадрат (число, умноженное само на себя).

// function sqvr (a){
//     console.log('function sqvr');
    
//     return a**2
// }
// let num_1=sqvr(3)
// console.log(num_1);


// // ***********************************************************************************************
// // ***********************************************************************************************

// function multi(a,b){
//     console.log('function multi');
    
//     console.log(a+b);
//     console.log(a-b);
//     console.log(a/b);
//     console.log(a*b);    
// }
// multi (2,3)
// // ***********************************************************************************************
// // ***********************************************************************************************



// // Создать функцию, которая в качестве аргументов получает два числа и выводит в консоль наибольшее.

// function max(a, b){
//     if (a>b) return `${a} mehr als ${b} `
//     if (a<b) return `${b} mehr als ${a} `
// }

// let result=max (7, 6)
// console.log(result);

// // ***********************************************************************************************
// // ***********************************************************************************************


// // Задания для практики
// // Задание 2:
// // Напиши функцию, которая принимает два числа и возвращает большее из них.

// function max_number(a, b){
//     if (a>b) return `${a} mehr als ${b}`
//     if (a<b) return `${b} mehr als ${a}`
//     return `${a} ist gleich ${b}`;  // Добавим случай, когда a равно b
// }
// result = max_number(8,9)
// console.log(result);

// // ***********************************************************************************************
// // ***********************************************************************************************


// // Задание 3:
// // Напиши функцию, которая принимает строку и возвращает её длину.

// function new_string(str){
//     return str.length;
// }
// let my_string = new_string('Test')
// console.log(my_string);

// // ***********************************************************************************************
// // ***********************************************************************************************

// function pifagor(a,b){
//     console.log('function pifagor: ');    
//     return Math.sqrt(a**2+b**2);

// }
// a = +prompt('Введите сторону катета а:');
// let b = +prompt('Введите сторону катета b:');

// result = pifagor(a,b)
// console.log(result);

// // ***********************************************************************************************
// // ***********************************************************************************************


// // Описать функцию, которая получает число и возвращает true, если число четное и false в ином случае.

// function even(a){
//     console.log('функцию, которая получает число и возвращает true, если число четное и false в ином случае.');
//     a=+prompt()
    
//     if(a%2===0) return true;
//     return false

//     // return a % 2 === 0
// }
// result = even(a);
// console.log(result);

// // let a=+prompt('function even: ')
// // console.log(even(a));

// // ***********************************************************************************************
// // ***********************************************************************************************


// // Описать функцию, которая получает в качестве аргумента число и возвращает массив из чисел от 0 до указанного числа.

// function all_number(num_2){
//     let arr_1=[];
//     for(let i=0; i<=num_2; i++){
//         arr_1.push(i)
//     }
//     return arr_1;  // Возвращаем массив <------------------------------------------------------------------------ not war
// }
// // let arr_1=[]; <------------------------------------------------------------------------ nicht notwendig
// let num_2=+prompt('функцию, которая получает в качестве аргумента число: ');
// /* let arr_1 = all_number(num_2);  */ // Вызываем функцию и сохраняем результат в arr_1 <------------------------------------------------------------------------not war
// console.log(all_number(num_2));


// // function declaration

// function func(a,b){
//     return a+b
// }

// // function expression
// const newFunc = function(){
//     return a+b
// }

// let new_99 = console.log;
// new_99('Test new_99')


// // arrow function

// const arrowFunc = (a,b)=>{
//     return a+b
// }

// async (params) => {
    
// }


// // -----------------------------------------------------------------
// let start =function (){

// }

// const car ={
//     brand: 'BMW',
//     madel: 'x5',
//     start: function(){
//         'Start Engenier'
//     }
// }


// console.log(car.start)

// // Напишите функцию, которая в качестве аргументов получает два числа и возвращает массив чисел со значениями от меньшего числа к большему.

// function range(a, b) {
//     let arr = [];
//     let min = Math.min(a, b);
//     let max = Math.max(a, b);
    
//     for (let i = min; i <= max; i++) {
//         arr.push(i);
//     }
    
//     return arr;
// }

// let num1 = +prompt('Напишите функцию, которая в качестве аргументов получает два числа и возвращает массив чисел со значениями от меньшего числа к большему.\nВведите первое число:');
// let num2 = +prompt('Напишите функцию, которая в качестве аргументов получает два числа и возвращает массив чисел со значениями от меньшего числа к большему.\nВведите второе число:');
// let result = range(num1, num2);
// console.log(result);


function sort(a,b){
    if(a<b){
        for (let i=a; i<=b; i++){
            arr_1.push(i)
        }
    }
    // 10   6    * 6 7 8 9 10
    else if(a>b){
        for (let i=b; i<=a; i++){
            arr_1.push(i)
        }
    }
    return arr_1
}
arr_1=[]
a = +prompt('Напишите функцию, которая в качестве аргументов получает два числа и возвращает массив чисел со значениями от меньшего числа к большему.\nВведите первое число:');
b = +prompt('Напишите функцию, которая в качестве аргументов получает два числа и возвращает массив чисел со значениями от меньшего числа к большему.\nВведите второе число:');
console.log(sort(a,b));

